{
  "items": [
    {
      "id": "19b0ba2bae5d123d",
      "subject": "Summary of failures for Google Apps Script: CHAMP News Manager",
      "date": "2025-12-10T23:19:32-05:00",
      "thumbnail": null,
      "snippet": "Your script, CHAMP News Manager, has recently failed to finish successfully. A summary of the failure(s) is shown below. To configure the triggers for this script, or change your setting for receiving",
      "from": "noreply-apps-scripts-notifications@google.com",
      "type": "news",
      "tags": [
        "news",
        "email",
        "news"
      ],
      "skinnyBody": "Your script, CHAMP News Manager, has recently failed to finish successfully. A summary of the failure(s) is shown below. To configure the triggers for this script, or change your setting for receiving future failure notifications, click here. Start Function Error Message Trigger End 12/9/25 11:19:31 PM EST updateChampNewsFeed We're sorry, a server error occurred while reading from storage. Error code RESOURCE_EXHAUSTED. time-based 12/9/25 11:19:31 PM EST Sincerely, Google Apps Script Need help? Visit the Google Apps Script documentation. Please do not reply to this message. (c) 2025 Google"
    },
    {
      "id": "19b0884cd6ad79eb",
      "subject": "[CHAMP: News] C.H.A.M.P.?s Weekend Update; Forecasting Next Events",
      "date": "2025-12-10T08:47:45-05:00",
      "thumbnail": "gallery/images/news-19b0884cd6ad79eb.jpg",
      "snippet": "*Report from C.H.A.M.P.?s 1st Foray, Lincoln, MA 12.7.25 * Larry started off saying something about the importance of noticing what we don?t see, but the presence of negative data couldn?t hold a cand",
      "from": "BasidiomyCody <basidiomycody@gmail.com>",
      "type": "news",
      "tags": [
        "news",
        "email",
        "news"
      ],
      "skinnyBody": "*Report from C.H.A.M.P.?s 1st Foray, Lincoln, MA 12.7.25 * Larry started off saying something about the importance of noticing what we don?t see, but the presence of negative data couldn?t hold a candle to what materialized 10 minutes later: Bulgaria inquinans, commonly called Black Bulgar or Bachelor?s Buttons ? bulbous protrusions like gobs of tar emerging from huge sawn logs ? oak, I believe. Matte black, like Finnish licorice, with cup-like depressions. I mistakenly thought the name had something to do with the former Soviet country, Bulgaria, but etymology filled the binomial with color and motion: ?inflated,? ?blister-like;? ?dirtying,? ?polluting,? ?blackening,? ?staining,? ?making unclean.? So be it - the dirty, bulging fungi left me feeling renewed. Larry?s words and our presence as a group in the woods ? Jula, his Dad, Martin, and son Micha; Dan, Liam, Sean, KieuLy, Larry, and myself ? amplified a simple message: even on a chilly, steel-grey New England morning, the forest floor holds a cache of little treasures ? like Hanukkah gelt or Christmas cookies ? cups, crusts, and jellies, resplendent in a quiet but full-throated way, edging out the inelegant rumble of the MBTA commuter rail trundling by. Arboreal chamber music enjoyed from front-row seats, reminding me of John Cage, amateur mycologist and vanguard creator of aleatory music: ?There is no such thing as an empty space or an empty time. There is always something to see, something to hear. In fact, try as we may to make a silence, we cannot.? A quick rundown of notable species seen: a cascade of lumpy polypores ? Trametes gibbosa; oak-log sections tinted with green wood-staining fungus ? Chlorociboria sp.; tiny matchstick fungi ? Phaeocalicium polyporaeum ? lifting off from the margins of purple-tooth polypores ? Trichaptum abietinum; and, as if bidding us farewell like tiny munchkins from Oz, a ?hairy fairy? ? Lachnum virgineum; and a troupe of Mycena sp. *On the Horizon* Stay tuned for our next events. Plans are underfoot for a movie night pegged to an ethnographic film. [image: image.jpeg] [image: image.jpeg] [image: image.jpeg] [image: image.jpeg]"
    }
  ]
}